{"loss": "categorical_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 100, 100], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "name": "input_2", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "dense_1"}, {"class_name": "Reshape", "config": {"target_shape": [32, 2500], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "reshape_1"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "inbound_nodes": [[["reshape_1", 0, 0]]], "name": "permute_1"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_1", "n": 2500}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "repeatvector_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_1", 0, 0], ["repeatvector_1", 0, 0]]], "name": "merge_1"}, {"class_name": "TimeDistributedDense", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "timedistributeddense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "timedistributeddense_1"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0003\u0000S(\u0003\u0000\u0000\u0000s\u001a\u0000\u0000\u0000Wrap keras backend repeat.i \u0000\u0000\u0000i\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000f\u0000\u0000\u0000repeat_elements(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001d\u0000\u0000\u0000/home/akadar/hieratt/model.pyt\b\u0000\u0000\u0000repeat_1\f\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [2500, 32], "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributeddense_1", 0, 0]]], "name": "lambda_1"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_1", 0, 0], ["lambda_1", 0, 0]]], "name": "merge_2"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_2"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "permute_2"}, {"class_name": "Reshape", "config": {"target_shape": [32, 50, 50], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["permute_2", 0, 0]]], "name": "reshape_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["reshape_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "maxpooling2d_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "dense_2"}, {"class_name": "Reshape", "config": {"target_shape": [32, 625], "trainable": true, "name": "reshape_3"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "reshape_3"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_3"}, "inbound_nodes": [[["reshape_3", 0, 0]]], "name": "permute_3"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_2", "n": 625}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "repeatvector_2"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_3", 0, 0], ["repeatvector_2", 0, 0]]], "name": "merge_3"}, {"class_name": "TimeDistributedDense", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "timedistributeddense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "timedistributeddense_2"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0003\u0000S(\u0003\u0000\u0000\u0000s\u001a\u0000\u0000\u0000Wrap keras backend repeat.i \u0000\u0000\u0000i\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000f\u0000\u0000\u0000repeat_elements(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001d\u0000\u0000\u0000/home/akadar/hieratt/model.pyt\b\u0000\u0000\u0000repeat_1\f\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [625, 32], "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributeddense_2", 0, 0]]], "name": "lambda_2"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_3", 0, 0], ["lambda_2", 0, 0]]], "name": "merge_4"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_4"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "permute_4"}, {"class_name": "Reshape", "config": {"target_shape": [32, 25, 25], "trainable": true, "name": "reshape_4"}, "inbound_nodes": [[["permute_4", 0, 0]]], "name": "reshape_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["reshape_4", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "dense_3"}, {"class_name": "Reshape", "config": {"target_shape": [32, 144], "trainable": true, "name": "reshape_5"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "reshape_5"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_5"}, "inbound_nodes": [[["reshape_5", 0, 0]]], "name": "permute_5"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_3", "n": 144}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "repeatvector_3"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_5", 0, 0], ["repeatvector_3", 0, 0]]], "name": "merge_5"}, {"class_name": "TimeDistributedDense", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "timedistributeddense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "timedistributeddense_3"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0003\u0000S(\u0003\u0000\u0000\u0000s\u001a\u0000\u0000\u0000Wrap keras backend repeat.i \u0000\u0000\u0000i\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000f\u0000\u0000\u0000repeat_elements(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001d\u0000\u0000\u0000/home/akadar/hieratt/model.pyt\b\u0000\u0000\u0000repeat_1\f\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [144, 32], "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributeddense_3", 0, 0]]], "name": "lambda_3"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_5", 0, 0], ["lambda_3", 0, 0]]], "name": "merge_6"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_6"}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "permute_6"}, {"class_name": "Reshape", "config": {"target_shape": [32, 12, 12], "trainable": true, "name": "reshape_6"}, "inbound_nodes": [[["permute_6", 0, 0]]], "name": "reshape_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["reshape_6", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "maxpooling2d_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "dense_4"}, {"class_name": "Reshape", "config": {"target_shape": [32, 36], "trainable": true, "name": "reshape_7"}, "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "name": "reshape_7"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_7"}, "inbound_nodes": [[["reshape_7", 0, 0]]], "name": "permute_7"}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_4", "n": 36}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "repeatvector_4"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_7", 0, 0], ["repeatvector_4", 0, 0]]], "name": "merge_7"}, {"class_name": "TimeDistributedDense", "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "timedistributeddense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 1}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "timedistributeddense_4"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0003\u0000S(\u0003\u0000\u0000\u0000s\u001a\u0000\u0000\u0000Wrap keras backend repeat.i \u0000\u0000\u0000i\u0002\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000f\u0000\u0000\u0000repeat_elements(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001d\u0000\u0000\u0000/home/akadar/hieratt/model.pyt\b\u0000\u0000\u0000repeat_1\f\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [36, 32], "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributeddense_4", 0, 0]]], "name": "lambda_4"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_7", 0, 0], ["lambda_4", 0, 0]]], "name": "merge_8"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u0013\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001S(\u0003\u0000\u0000\u0000s\u0017\u0000\u0000\u0000Wrap keras backend sum.t\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000sum(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000x(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001d\u0000\u0000\u0000/home/akadar/hieratt/model.pyt\u0004\u0000\u0000\u0000sum_\u0010\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0002", "name": "lambda_5", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [32], "output_shape_type": "raw"}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "lambda_5"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 5}, "inbound_nodes": [[["lambda_5", 0, 0]]], "name": "dense_5"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_5", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}